Revit 2024 API
NavisworksExportOptions.FacetingFactor Property
 Faceting factor. Default value is 1.0.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2020
Syntax
C#
public double FacetingFactor { get; set; }
Visual Basic
Public Property FacetingFactor As Double
	Get
	Set
Visual C++
public:
property double FacetingFactor {
	double get ();
	void set (double value);
}
See Also
NavisworksExportOptions Class
Autodesk.Revit.DB Namespace